# ProfileId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
NonContinuousRailInfo..::..ProfileId Property
NonContinuousRailInfo Class See Also
---
The profile id of the non-continuous rail, or invalidElementId if none.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public ElementId ProfileId { get; set; }
```

Visual Basic
---
```text
Public Property ProfileId As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ ProfileId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The profileId is not an Id of a valid NonContinuousRail profile. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
NonContinuousRailInfo Class
Autodesk.Revit.DB.Architecture Namespace